ysuolmai/conduit-stream/framework/sdkconfig.defaults.n4r2-max98357a
# ESP32-S3 N4R2 + MAX98357A target.
CONFIG_IDF_TARGET="esp32s3"

# 4 MB QIO flash, 2 MB quad PSRAM.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SIZE=2097152
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_MODE_OCT=n
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions-n4r2.csv"

# Reduce the two largest audio buffers for the 2 MB PSRAM target.
CONFIG_CONDUIT_SMALL_MEMORY=y

# I2S: ESP32 GPIO11 -> MAX98357A DIN, GPIO12 -> BCLK, GPIO13 -> LRC/WS.
CONFIG_CONDUIT_I2S_DOUT_GPIO=11
CONFIG_CONDUIT_I2S_BCLK_GPIO=12
CONFIG_CONDUIT_I2S_LRCK_GPIO=13
CONFIG_CONDUIT_MONO_OUTPUT=y

# Use the native USB Serial/JTAG console on S3 boards with USB-C.
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
